string = 1
data = []

while string != '':
    string = input('Введите через пробел Предмет, Фамилию и Оценку: ')
    data.append(string.split(' '))
data.pop (-1)

#data = [['матиматика', 'Петров', '4'],
#       ['матиматика', 'Петров', '5'],
#       ['матиматика', 'Петров', '4'],
#       ['матиматика', 'Иванов', '4'],
#       ['матиматика', 'Иванов', '4'],
#       ['матиматика', 'Иванов', '3'],
#       ['матиматика', 'Сидоров', '4'],
#       ['матиматика', 'Сидоров', '3'],
#       ['матиматика', 'Сидоров', '2'],
#       ['русский', 'Иванов', '4'],
#       ['русский', 'Иванов', '3'],
#       ['русский', 'Иванов', '4'],
#       ['русский', 'Петров', '5'],
#       ['русский', 'Петров', '5'],
#       ['русский', 'Петров', '5'],
#       ['русский', 'Сидоров', '3'],
#       ['русский', 'Сидоров', '4'],
#       ['литература', 'Сидоров', '5'],
#       ['литература', 'Сидоров', '4'],
#       ['литература', 'Петров', '5'],
#       ['литература', 'Петров', '5'],
#       ['литература', 'Иванов', '5'],
#       ['литература', 'Иванов', '4'],]
#
#print(data)

journal = {}
for string in data:
    subject, name, mark = string
    if subject in journal:
        if name in journal[subject]:
            journal[subject][name].append(mark)
        else:
            journal[subject][name] = [mark]
    else:
        journal[subject] = {name: [mark]}
#print(journal)

for subject in journal.items():
    print(subject[0])
    for name in subject[1].items():
        print(name[0], ' '.join(name[1]))
    print()